{
    "message": {
      "title": "My portfolio",
      "slogan": "My name is Rostyslav Luchyshyn and I'm a web developer"
    },
    "navigation": {
      "home": "Home",
      "cv": "About",
      "projects": "Projects",
      "photogallery": "Photo Gallery",
      "contact": "Contact"
    },
    "languageNames": {
      "en": "English",
      "fr": "French"
    },
    "contactForm": {
      "title": "Contact",
      "subtitle": "Contact me through social media or email",
      "name": "Your name",
      "email": "Your email",
      "message": "Your message",
      "submit": "Submit",
      "messageSuccess": "Thank you for your message!",
      "placeholderName": "ex. John Doe",
      "placeholderEmail": "email address",
      "placeholderMessage": "Write your message here",
      "requiredName": "Name is required",
      "requiredEmail": "Email is required",
      "requiredMessage": "Message is required",
      "requiredSymolsEmail": "Email must have address sign and dot"
    },
    "resume": {
      "profilTitle": "Profile",
      "profilText": "I am passionate about creating websites and interactive applications. My goal is to contribute to innovative projects, continuously learn, and grow within a dynamic team. I want to apply my front-end and back-end development skills to create exceptional user experiences.",
      "experienceTitle": "Experience",
      "experienceItems": [
        {
          "title": "Web developer intern",
          "company": "Euro Style Design Inc",
          "date": "04/2024 - 05/2024",
          "taskDescription": [
            "Development and customization of WordPress sites for clients, using plugins such as WooCommerce and Elementor.",
            "Collaboration with the design team to translate client needs into technical features.",
            "Troubleshooting compatibility and performance optimization issues.",
            "Implementation of SEO best practices to improve site visibility.",
            "Training and supporting clients in the use of their sites."
          ]
        },
        {
          "title": "IT Technician (volunteer)",
          "company": "Projet Immigrant",
          "date": "08/2023 - present",
          "taskDescription": [
            "Installation and maintenance of computer hardware for new immigrants, ensuring access to necessary resources.",
            "Providing technical assistance and training in basic computer skills and software use.",
            "Coordination with other volunteers to provide efficient service to users.",
            "Management and documentation of technical requests and problem resolution."
          ]
        }
      ],
      "educationTitle": "Education",
      "educationItems": [
        {
          "title": "AEC in WEB site design and programming",
          "school": "Collège de Maisonneuve, Montréal, QC, Canada",
          "date": "01/2023 - 05/2024",
          "description": "Developed skills in front-end and back-end web development, including HTML, CSS, JavaScript, PHP, and MySQL. Created responsive websites and web applications using modern frameworks and libraries such as Bootstrap, Vue.js, and Laravel."
        },
        {
          "title": "University Specialist Diploma in ingeneering geodesy",
          "school": "National Polytechnic University of Lviv, Ukraine",
          "date": "07/2003 - 12/2004",
          "description": "Developed skills in geodesy, cartography, and land management. Conducted field surveys and created topographic maps using specialized software."
        },
        {
          "title": "Bachelor of Science in Geodesy and Land Management",
          "school": "National Polytechnic University of Lviv, Ukraine",
          "date": "09/1999 - 06/2003",
          "description": "Developed skills in geodesy, cartography, and land management. Conducted field surveys and created topographic maps using specialized software."
        }
      ],
      "skillsTitle": "Skills",
      "downloadCvTitle": "Download CV"
    },
    "projects": {
      "title": "My projects",
      "projectItems": [
        {
          "title": "Vino Project (College Maisonneuve)",
          "description": "This project involved the enhancement and development of a transactional web application, carried out in a team of 3 members. The application, named 'Vino' was designed to help users manage their wine cellars. Utilizing AGILE/SCRUM project management methodologies and Git for version control, the project was developed with a mobile-first approach. The final product allowed users to view and update their wine inventory from various devices (Mac, PC, Android, iOS) and across major browsers. The project was completed in three phases, focusing on design, code restructuring, bug fixes, and adding essential features, with each team member contributing to both front-end and back-end development.",
          "alt": "Screenshot of the Vino Project web application showing wine inventory management features."
        },
        {
          "title": "My portfolio",
          "description": "This project is a bilingual website (English and French) developed using Vue.js 3 for the front-end and Node.js for the back-end. The site features a smooth, modern user interface with a strong focus on responsiveness and user experience. With Vue Router and i18n integration, users can seamlessly switch between the English and French versions. The Node.js backend efficiently handles requests, ensuring optimized performance. This project showcases my full-stack development skills, emphasizing dynamic, multilingual interfaces.",
          "alt": "Screenshot of my portfolio website showing a modern, responsive design with language switcher"
        }
      ]
    }
  }
  